// Дано трехзначное число. Определить: кратна ли пяти сумма его цифр.

int max = 2;
int min = 3;
int sum = 0;
System.Console.WriteLine(sum = max + min);
